server/app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 86]]
---
    def destroy
        answer = Answer.find_by(id: params[:id])
        if answer.destroy