server/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find(session[:user_id]) if
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]