server/app/controllers/mobile_api_controller.rb

    def list_tests
        @tests = Test.all
---
SELECT "tests".* FROM "tests"

    def show
        @test = Test.where(id: params[:id]).first
        if @test.present?
            questions = []

            @test.questions.each do |q|
                @answers = Answer.where(question_id: q.id)
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? ORDER BY "tests"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 8]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 12]]

    def create
        score = 0
        # calculate score
        params[:answers].each do |a|
            answer = Answer.find_by(id: a['answer_id'])
            @question = Question.find_by(id: answer.question_id)
            if @question.correct_ans == answer.choice
                score +=1
            end
        end

        @result = Result.new(score: score, test_id: @question.test_id, user_id: current_user.id)

        if @result.save
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "results" ("score", "test_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["score", 2], ["test_id", 8], ["user_id", nil], ["created_at", "2022-10-06 09:06:15.994445"], ["updated_at", "2022-10-06 09:06:15.994445"]]