server/app/controllers/questions_controller.rb

    def destroy
        question = Question.find_by(id: params[:id])
        if question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 15]]

    def show
        @question = Question.where(id: params[:id]).first
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]