server/app/controllers/sessions_controller.rb

    def create
        user = User.find_by(email: params[:email])

        if user.present? && user.authenticate(params[:password]) && user.role == "teacher"
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "teacher@example.com"], ["LIMIT", 1]]