server/app/controllers/tests_controller.rb

    def create

        @test = Test.new(test_params)

        if @test.save
---
INSERT INTO "tests" ("name", "created_at", "updated_at", "description", "questions_count") VALUES (?, ?, ?, ?, ?)  [["name", "222"], ["created_at", "2022-10-06 12:02:38.180913"], ["updated_at", "2022-10-06 12:02:38.180913"], ["description", "222"], ["questions_count", 0]]

    def update
        @test = Test.find(params[:id])

        if @test.update(name: params[:name],description: params[:description])


            # delete questions that were deleted by admin from db
            @questions = Question.where(test_id: @test.id)
            @questions.each do |q_db|
                flag = true
                params[:questions_attributes].each do |q|
                    if q["id"] == q_db.id
                        flag= false
                        break
                    end
                end
                if  flag
                    Question.find_by(id: q_db['id']).destroy
                end
            end

            #loop over questions to update each one indvidually
            params[:questions_attributes].each do |q|
                # if question is newlly added, create it in the db
                if q['id'] == nil
                    @question = Question.create(label: q['label'],description: q['description'],correct_ans: q['correct_ans'], test_id: @test.id)
                else
                # update if exist
                    @question = Question.find_by(id: q['id'])
                    @question.update(label: q['label'],description: q['description'],correct_ans: q['correct_ans'])
                end

                # delete answers that were deleted by admin from db
                @answers = Answer.where(question_id: q['id'])
                @answers.each do |a_db|
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "tests" SET "updated_at" = ?, "description" = ? WHERE "tests"."id" = ?  [["updated_at", "2022-10-06 14:21:00.808896"], ["description", "101 math"], ["id", 10]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 6]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 5]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 16]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "questions" ("description", "created_at", "updated_at", "test_id", "label", "correct_ans") VALUES (?, ?, ?, ?, ?, ?)  [["description", ""], ["created_at", "2022-10-06 14:36:14.135000"], ["updated_at", "2022-10-06 14:36:14.135000"], ["test_id", 11], ["label", "fr"], ["correct_ans", ""]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "tests" SET "questions_count" = COALESCE("questions_count", 0) + ? WHERE "tests"."id" = ?  [["questions_count", 1], ["id", 11]]
UPDATE "questions" SET "updated_at" = ?, "label" = ?, "correct_ans" = ? WHERE "questions"."id" = ?  [["updated_at", "2022-10-06 14:26:02.141789"], ["label", "1+1"], ["correct_ans", "2"], ["id", 17]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 14]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 17]]

                        end
                    end
                    if  flag
                        Answer.find_by(id: a_db['id']).destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 131]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 131], ["LIMIT", 1]]

                q["answers_attributes"].each do |a|
                    # if answer is newlly added, create it in the db
                    if a['id'] == nil
                        Answer.create(choice: a['choice'], question_id: @question.id)
                    else
                    #update
                        @answer = Answer.find_by(id: a['id'])
                        @answer.update(choice: a['choice'])
---
INSERT INTO "answers" ("choice", "created_at", "updated_at", "question_id") VALUES (?, ?, ?, ?)  [["choice", ""], ["created_at", "2022-10-06 14:36:14.194749"], ["updated_at", "2022-10-06 14:36:14.194749"], ["question_id", 19]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 126], ["LIMIT", 1]]
UPDATE "answers" SET "choice" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["choice", "0"], ["updated_at", "2022-10-06 14:20:50.282749"], ["id", 130]]

    def destroy
        @test = Test.find_by(id: params[:id])

        if @test.destroy
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 12]]

    def show
        @test = Test.where(id: params[:id]).first
        if @test.present?
            questions = []

            @test.questions.each do |q|
                @answers = Answer.where(question_id: q.id)
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? ORDER BY "tests"."id" ASC LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 8]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 13]]