server/app/controllers/users_controller.rb

    def create
        @user = User.new(email: params[:email], password: params[:password], password_confirmation:
        params[:password_confirmation], name: params[:name], role: params[:role])

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "nour@gmail.com"], ["password_digest", "[FILTERED]"], ["name", "noura"], ["role", "teacher"], ["created_at", "2022-10-06 18:37:34.772788"], ["updated_at", "2022-10-06 18:37:34.772788"]]

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "student"], ["updated_at", "2022-10-06 18:37:40.139035"], ["id", 22]]

    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

    def show
        @user = User.where(id: params[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 22], ["LIMIT", 1]]